app/controllers/api/v1/base_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "test@test.com"], ["LIMIT", 1]]
---
    def authenticate_user_using_x_auth_token
      user_email = request.headers["X-Auth-Email"]
      auth_token = request.headers["X-Auth-Token"].presence
      user = user_email && User.find_by_email(user_email)