app/controllers/api/v1/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["email", ""], ["LIMIT", 1]]
---
  def create
    user = User.find_for_database_authentication(email: params[:user] && params[:user][:email])

SELECT "users".* FROM "users" WHERE "users"."authentication_token" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["authentication_token", "FLPdn84votnei3UAa_zs"], ["LIMIT", 1]]
---
  def destroy
    @user = User.find_by(authentication_token: request.headers["X-Auth-Token"])