app/controllers/api/v1/users_controller.rb

  def invite
    user = User.find_by(authentication_token: request.headers["X-Auth-Token"])
    Invitation.create(user_id: user.id, invited_email: user_params[:email])
---
INSERT INTO "invitations" ("user_id", "invited_email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", "3a6ca26f-c5b6-438c-99fe-49bfba3bdbb3"], ["invited_email", "test@test.com"], ["created_at", "2021-10-25 21:36:39.505116"], ["updated_at", "2021-10-25 21:36:39.505116"]]
INSERT INTO "users" ("email", "encrypted_password", "authentication_token", "created_at", "updated_at", "name") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    if @user.blank?
      respond_with_error "User with id #{params[:id]} not found.", :not_found

    elsif @user.update(user_params)
---
UPDATE "users" SET "sign_in_count" = $1, "current_sign_in_at" = $2, "last_sign_in_at" = $3, "current_sign_in_ip" = $4, "last_sign_in_ip" = $5, "updated_at" = $6 WHERE "users"."id" = $7