app/controllers/api/v1/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."invite_token" IS NULL LIMIT $1  [["LIMIT", 1]]
---
  def create
    inviting_user_id = User.find_by(invite_token: user_params[:invite_token])&.id