app/controllers/api/v1/users_controller.rb

SELECT "users".* FROM "users"
---
  def standings
    users = User.all
    standings = users.map { |user| [user.email, [user.name, user.total_points]] }.sort { |a| a[1][1] }.to_h

SELECT "users".* FROM "users" WHERE "users"."authentication_token" = $1 AND "users"."email" = $2 LIMIT $3  [["authentication_token", "iZoz6PX1rdLYFNznxkYx"], ["email", "test@test.com"], ["LIMIT", 1]]
---
  def invite
    user = User.find_by(authentication_token: request.headers["X-Auth-Token"], email: request.headers["X-Auth-Email"] )

SELECT "users".* FROM "users" WHERE "users"."authentication_token" = $1 AND "users"."email" = $2 LIMIT $3  [["authentication_token", "hKujoHQH6pVe7PzPcbF6"], ["email", "mail@gmail.com"], ["LIMIT", 1]]
---
  def get_lucky
    user = User.find_by(authentication_token: request.headers["X-Auth-Token"], email: request.headers["X-Auth-Email"] )

SELECT "invitations".* FROM "invitations" WHERE "invitations"."invited_email" = $1 LIMIT $2  [["invited_email", "yonatnh@gmail.com"], ["LIMIT", 1]]
INSERT INTO "users" ("email", "encrypted_password", "authentication_token", "created_at", "updated_at", "name", "invite_token") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    inviting_user_id = Invitation.find_by(invited_email: user_params[:email])&.user_id
    user = User.create(user_params.merge({ parent_id: inviting_user_id }))

UPDATE "users" SET "sign_in_count" = $1, "current_sign_in_at" = $2, "last_sign_in_at" = $3, "current_sign_in_ip" = $4, "last_sign_in_ip" = $5, "updated_at" = $6 WHERE "users"."id" = $7
---
  def update
    if @user.blank?
      respond_with_error "User with id #{params[:id]} not found.", :not_found

    elsif @user.update(user_params)