app/models/point_transaction.rb

INSERT INTO "point_transactions" ("user_id", "value", "source", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", "23a59476-ab66-4072-b79a-1efeff223ca5"], ["value", "323.0"], ["source", 2], ["created_at", "2021-10-28 21:26:25.537801"], ["updated_at", "2021-10-28 21:26:25.537801"]]
UPDATE "users" SET "updated_at" = $1, "get_lucky_count" = $2, "last_get_lucky_date" = $3 WHERE "users"."id" = $4  [["updated_at", "2021-10-28 21:26:25.558921"], ["get_lucky_count", 1], ["last_get_lucky_date", "2021-10-28"], ["id", "23a59476-ab66-4072-b79a-1efeff223ca5"]]
---
  def self.get_lucky(user)
    current_count = user.get_lucky_count

    value = rand(GET_LUCKY_MAX)
    points = PointTransaction.create(user_id: user.id, value: value, source: :lucky)

    user.update(get_lucky_count: current_count + 1, last_get_lucky_date: Date.current) if points