app/models/user.rb

  def ensure_authentication_token_is_present
    if authentication_token.blank?
---
SELECT "users".* FROM "users" WHERE "users"."authentication_token" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["authentication_token", "jH9zzFpBssT7R6TiXHC9"], ["LIMIT", 1]]

  def generate_authentication_token
    loop do
      token = Devise.friendly_token
      break token unless User.where(authentication_token: token).first
---
SELECT "users".* FROM "users" WHERE "users"."authentication_token" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["authentication_token", "GAyhdzub9X6sYkwAtWsK"], ["LIMIT", 1]]

  def deliver_invitation_points
    return unless parent_id

    user = User.find_by(id: parent_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]